package lesson1;

import org.openqa.selenium.By;
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.chrome.ChromeDriver;

public class Locators2 {
    public static void main(String[] args) {
        //Поиск элементов при помощи css

        //пробелы заменяем точками
        //поиск по тегу


        //поиск по id. Используем символ #


        //поиск по классу .имя_класса


        //Любой другой атрибут пишем в []


        //нахождение по буквосочетанию


        //нахождение по первым символам


        //нахождение по последним символам

        //несколько классов плюс через пробел можем двигаться к дочерним вложенностям


        //еще один пример вложенности


        //для поиска непосредственного ребенка можно использовать >

    }
}
